In [ ]:
!pip install pandas_summary
from google.colab import drive
drive.mount('/content/drive')
PATH = '/content/drive/MyDrive/Colab Notebooks/kaggle-rossmann/dataset/rossmann/'
%cd '/content/drive/MyDrive/Colab Notebooks/kaggle-rossmann'

Collecting pandas_summary
  Downloading https://files.pythonhosted.org/packages/f5/20/865d4785f86e86f7ad7ebd52fc14810ef59ef13cd959f1363a2615d1c665/pandas_summary-0.0.7-py2.py3-none-any.whl
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from pandas_summary) (1.19.5)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from pandas_summary) (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandas_summary) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas->pandas_summary) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->pandas_summary) (1.15.0)
Installing collected packages: pandas-summary
Successfully installed pandas-summary-0.0.7
Mounted at /content/drive
/content/drive/MyDrive/Colab Notebooks/kaggle-rossmann

In [ ]:
%matplotlib inline

In [ ]:
!pip install isoweek

import math, keras, datetime, pandas as pd, numpy as np, keras.backend as K
import matplotlib.pyplot as plt, xgboost, operator, random, pickle
from isoweek import Week

Collecting isoweek
  Downloading https://files.pythonhosted.org/packages/c2/d4/fe7e2637975c476734fcbf53776e650a29680194eb0dd21dbdc020ca92de/isoweek-1.3.3-py2.py3-none-any.whl
Installing collected packages: isoweek
Successfully installed isoweek-1.3.3

In [ ]:
import pandas as pd
!pip install pandas_summary
from pandas_summary import DataFrameSummary

Requirement already satisfied: pandas_summary in /usr/local/lib/python3.7/dist-packages (0.0.7)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from pandas_summary) (1.19.5)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from pandas_summary) (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandas_summary) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas->pandas_summary) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->pandas_summary) (1.15.0)

In [ ]:
sample_csv = pd.read_csv('dataset/rossmann/sample_submission.csv')
#sample_csv['Sales'] = y_pred_test
#sample_csv.head()

#sample_csv.to_csv(f'submision_lGBM_full.csv', index=False)

In [ ]:
sample_csv

          Id  Sales
0          1      0
1          2      0
2          3      0
3          4      0
4          5      0
...      ...    ...
41083  41084      0
41084  41085      0
41085  41086      0
41086  41087      0
41087  41088      0

[41088 rows x 2 columns]

In [ ]:
model_1 = pd.read_csv('submision_True-5-4000-0.05.csv')
model_2 = pd.read_csv('submission_MLP_video.csv')
model_3 = pd.read_csv('submision_lightgbm_last_week-True-5-4000-0.1.csv')

In [ ]:
model_1

          Id         Sales
0          1   3650.224443
1          2   6640.397895
2          3   8284.478909
3          4   6349.246852
4          5   6653.195485
...      ...           ...
41083  41084   2961.708152
41084  41085   7494.871022
41085  41086   5600.542732
41086  41087  27502.470700
41087  41088   6920.422543

[41088 rows x 2 columns]

In [ ]:
combination = model_1.merge(model_2, how='left', left_on='Id', right_on='Id', suffixes=("1", "2"))

In [ ]:
combination = combination.merge(model_3, how='left', left_on='Id', right_on='Id', suffixes=("", "3"))

In [ ]:
combination

          Id        Sales1      Sales2         Sales
0          1   3650.224443   4312.6694   3947.392046
1          2   6640.397895   7083.7764   7203.561734
2          3   8284.478909   8581.2910   9058.286732
3          4   6349.246852   7466.6055   7366.881193
4          5   6653.195485   6833.3203   7745.838247
...      ...           ...         ...           ...
41083  41084   2961.708152   3233.5042   3069.909554
41084  41085   7494.871022   8117.4700   7782.204325
41085  41086   5600.542732   6671.3228   6085.275087
41086  41087  27502.470700  23580.9240  24736.060053
41087  41088   6920.422543  10617.5710   7119.050059

[41088 rows x 4 columns]

In [ ]:
combination['SalesAVG'] = (combination['Sales1']+combination['Sales2']+combination['Sales'])/3
#combination['SalesAVG'] = (combination['Sales1']+combination['Sales2'])/2

In [ ]:
combination

          Id        Sales1      Sales2         Sales      SalesAVG
0          1   3650.224443   4312.6694   3947.392046   3970.095296
1          2   6640.397895   7083.7764   7203.561734   6975.912010
2          3   8284.478909   8581.2910   9058.286732   8641.352213
3          4   6349.246852   7466.6055   7366.881193   7060.911182
4          5   6653.195485   6833.3203   7745.838247   7077.451344
...      ...           ...         ...           ...           ...
41083  41084   2961.708152   3233.5042   3069.909554   3088.373969
41084  41085   7494.871022   8117.4700   7782.204325   7798.181782
41085  41086   5600.542732   6671.3228   6085.275087   6119.046873
41086  41087  27502.470700  23580.9240  24736.060053  25273.151584
41087  41088   6920.422543  10617.5710   7119.050059   8219.014534

[41088 rows x 5 columns]

In [ ]:
combination['SalesAVG']

0         4470.255233
1         7437.302489
2         8423.261050
3         7292.600645
4         7234.313338
             ...
41083     3500.504303
41084     8608.815628
41085     6809.745352
41086    23153.479124
41087     8671.540145
Name: SalesAVG, Length: 41088, dtype: float64

In [ ]:
sample_csv = pd.read_csv('dataset/rossmann/sample_submission.csv')
sample_csv['Sales'] = combination['SalesAVG']
sample_csv.head()

sample_csv.to_csv(f'submision_avg.csv', index=False)